 [
   {
    "title": "The Boy Who Drew Cats",
    "author": "Koizumi Yakumo",
     "collection": "Japanese Fairy Tales",
     "id": 1,
    "content": "A farmer has many children, who are all hard-working, except for his youngest, who is small and weak and only interested in drawing pictures of cats. He decides his son is not cut out to be a farmer, and sends him to a temple to study with a priest. The boy spends all his time drawing cats instead of studying. The priest tells him he's better suited to being an artist and should return home. As he sends him on his way, the priest warns the boy: 'Avoid large places at night. Keep to the small.' Ashamed of being dismissed, the boy decides not to return to his father's farm. Instead, he travels to another temple in the hopes he can ask for a night's shelter, not realizing all the priests living there have long-ago been driven away by a giant goblin-rat. When the boy arrives, he finds the place deserted and decides to draw cats on the walls. As he begins to feel tired, he remembers the old priest's words and climbs inside a little cabinet to go to sleep. During the night he hears horrible sounds of screaming and fighting. When morning comes and he finally climbs out, he discovers the corpse of the goblin-rat. As he wonders what could have killed it, he notices that all his cats now have blood on their mouths. He is hailed as a hero for defeating the monster, and grows up to be a famous artist - one who only draws cats."
  },
 {
   "title": "The Crystal Ball",
   "author": "Unknown",
   "collection": "The Brothers Grimm",
   "id": 2,
   "content": "A sorceress was afraid of her three sons. She turned the oldest into an eagle and the second into a whale, and each could take his human form for only two hours a day. The youngest son fled before he could suffer the same fate and went off to seek the king's daughter, bewitched and held prisoner in the Castle of the Golden Sun. He saw two giants quarreling over a wishing cap and they asked him to settle the dispute. He put on the cap, forgot he had it on, and wished himself to the castle.The king's daughter told him that only a crystal ball would break the enchantment. She directed him to go down the mountain and fight a wild bull beside a spring. If he killed it, a bird would spring out of it. If the bird was forced to let free an egg in its body, the crystal ball was its yolk, but the egg would light everything about it on fire if dropped on the land.He fought the bull. The bird sprang free, but his brother the eagle harried it until it dropped the egg. This landed on a fisherman's hut, setting it ablaze, but his brother the whale drowned the hut with waves. The youngest brother took the crystal ball to the enchanter, who admitted himself defeated and told him that the ball would also break the spell on his brothers. The youngest hurried to the princess, and they exchanged rings."
 }
]